// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

let time = +prompt('Введіть хвилину від 0 до 59');
if (time>=0 && time<=14){
    confirm('Це перша чверть години');
    console.log('Це перша чверть години');
} else if (time>=15 && time<=29){
    confirm('Це друга чверть години');
    console.log('Це друга чверть години');
}
else if (time>=30 && time<=44){
    confirm('Це третя чверть години');
    console.log('Це третя чверть години');
}
else if (time>=45 && time<=59){
    confirm('Це четверта чверть години');
    console.log('Це четверта чверть години');
}
else if (time>=59 || time<=0){
    confirm('Ви ввели не вірне значення, спробуйте ща раз');
    console.log('Ви ввели не вірне значення, спробуйте ща раз');
}

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

let days = +prompt('Введіть число від 1 до 31');
if (days>=1 && days<=9){
    confirm('Це є перша декада місяця');
    console.log('Це є перша декада місяця');
}
else if (days>=10 && days<=19){
    confirm('Це є друга декада місяця');
    console.log('Це є друга декада місяця');
}
else if (days>=19 && days<=31){
    confirm('Це є третя декада місяця');
    console.log('Це є третя декада місяця');
} else if (days<=0 || days>=32){
    confirm('Ви ввели не вірне значення, спробуйте ща раз');
    console.log('Ви ввели не вірне значення, спробуйте ща раз');
}

// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

let test = prompt('Введіть true або falce');
if (test===true){
    confirm("Вірно");
    console.log("Вірно");
} else if (test !== true){
    confirm("Невірно");
    console.log("Невірно");
}

// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

let a = +prompt('Введіть число');
if (a === 0){
    confirm('Вірно');
    console.log('Вірно');
} else {
    confirm('Невірно');
    console.log('Невірно');
}

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

let day = +prompt('Введіть номеря дня тижня');
switch (day) {
    case 1 :
        confirm('Понеділок: Треба відпочити від неділі');
        console.log('Понеділок: Треба відпочити від неділі');
        break;
        case 2 :
        confirm('Вівторок: Сьогодні вже можна і на роботу сходити');
        console.log('Вівторок: Сьогодні вже можна і на роботу сходити');
break;
    case 3 :
        confirm('Середа: Варто початі худнути до літа');
        console.log('Середа: Варто початі худнути до літа');
        break;
    case 4 :
        confirm('Четвер: Маю добре попрацювати, а то вже кінець тижня');
        console.log('Четвер: Маю добре попрацювати, а то вже кінець тижня');
        break;
    case 5 :
        confirm("П'ятниця Ура!!! Ось і закінчився тиждень)");
        console.log("П'ятниця: Ура!!! Ось і закінчився тиждень)");
        break;
    case 6 :
        confirm('Субота: Вихідний!!!');
        console.log('Субота: Вихідний!!!');
        break;
    case 7 :
        confirm('Неділя: Вихідний!!!');
        console.log('Неділя: Вихідний!!!');
}

// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
let year = +prompt('Введіть рік');
if (year % 4 === 0){
    confirm('Вказанний Вами рік був, є, чи буде високосним');
    console.log('Вказанний Вами рік був є чи буде високосним');
}
else {
    confirm('Вказанний Вами рік не був, не є, чи не буде високосним');
    console.log('Вказанний Вами рік не був, не є, чи не буде високосним');
}
// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

let result = prompt('Яка «офіційна» назва JavaScript ?');
if (result === 'ECMAScript'){
    confirm('Правильно');
    console.log('Правильно!');
}
else {
    confirm('Не знаєте? ECMAScript !');
    console.log('Не знаєте? ECMAScript !');
}