
//- Є змінна х, якій ви надаєте довільне числове значення.
// Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

let a = prompt('Ввудіть число')
    if (a != 0) {
        confirm('Вірно')
    }
    else {confirm('Невірно')}

    //- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

let time = prompt('Введіть число від 0 до 59')
if (time === 0 && time < 15 ){
    confirm('Число відноситься до першої чверті години')
} else if (time > 15 && time < 30) {
    confirm('Число відноситься до другої чверті години')
} else if (time > 30 && time < 45) {
    confirm('Число відноситься до третьої чверті години')
} else if (time > 45 && time < 59) {
    confirm('Число відноситься до четвертої чверті години')
} else { confirm('Sorry, I am not understand')
    }

//- У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

let day = prompt('Введіть число від 0 до 31')
if (day < 11){
    confirm('Це перша декада місяця')
} else if (day >10 && day <21 ){
    confirm('Це друга декада місяця')
} else if (day > 20 && day < 32){
    confirm('Це третя декада місяця')
} else { confirm('Sorry, I am not understand')}

//- Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).

let day = prompt('Введіть назву дня тижня з великої літери')
switch (day) {
    case 'Понеділок':
        confirm('Monday');
        break;
    case 'Вівторок':
        confirm('Tuesday');
        break;
    case 'Середа':
        confirm('Wednesday');
        break;
    case 'Четвер':
        confirm('Thursday');
        break;
    case `П'ятниця`:
        confirm('Friday');
        break;
    case 'Субота':
        confirm('Saturday');
        break;
    case 'Неділя':
        confirm('Sunday');
        break;
    default: confirm('Sorry, I am not understand');
}

//- Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.

let num1 = prompt('Введіть перше число')
let num2 = prompt('Введіть друге число')
if (num1 > num2){
    confirm('Число' +num1 +'більше!!!')
} else if (num1 < num2){
    confirm('Число'+ num2 +'більше!!!')
}else if (num1 === num2){
    confirm('Ви ввели два рівні числа!!!')
} else (confirm('Sorry, I am not understand'));